// Давайте відтворимо цю піраміду на С, подамо у тексті за допомогою хешів (#), які будуть замість цеглин. Кожен хеш трохи вищий, ніж ширший, тож і сама піраміда стає вищою та вужчою.
// 
//    #  #
//   ##  ##
//  ###  ###
// ####  ####
// Наша програма буде називатись mario. Давайте дамо користувачеві можливість вирішити самостійно, наскільки високою має бути піраміда, спочатку запитавши в нього чи в неї ціле число від 1 до 8 включно.
// 
// Ось, як має працювати програма, якщо користувач ввів число 8:
// 
// $ ./mario
// Height: 8
//        #  #
//       ##  ##
//      ###  ###
//     ####  ####
//    #####  #####
//   ######  ######
//  #######  #######
// ########  ########



// #include <cs50.h>
// #include <stdio.h>

int main(void)
{
    int num;

    do {
        num = get_int("Height: ");
    } while (num < 1 || num > 8);

    for (int i = 0; i < num; i++) {

        for (int j = i + 1; j < num; j++) {
            printf(" ");
        }
        for (int k = num - i - 1; k < num; k++ ){
            printf("#");
        }
        for (int z = 0; z < 2; z++){
            printf(" ");
        }
        for (int k = num - i - 1; k < num; k++ ){
            printf("#");
        } 
        

        printf("\n");        
    }
}

